In [2]:
prices_a = [8.70, 8.91, 8.71]

In [3]:
prices_a[1:]

[8.91, 8.71]

In [4]:
prices_a[:-1]

[8.7, 8.91]

In [5]:
import numpy as np

In [6]:
np_prices = np.array(prices_a)

In [7]:
np_prices

array([8.7 , 8.91, 8.71])

In [8]:
np.array(np_prices[1:])

array([8.91, 8.71])

In [11]:
np.array(np_prices[1:])/np.array(np_prices[:-1]) - 1

array([ 0.02413793, -0.02244669])

In [12]:
import pandas as pd

In [13]:
pd_prices = pd.DataFrame({
    "BLUE": [8.70, 8.91, 8.71, 8.43, 8.73],
    "ORANGE": [10.66, 11.08, 10.71, 11.59, 12.11]
})

In [14]:
pd_prices

   BLUE  ORANGE
0  8.70   10.66
1  8.91   11.08
2  8.71   10.71
3  8.43   11.59
4  8.73   12.11

In [16]:
pd_prices.iloc[1:]

   BLUE  ORANGE
1  8.91   11.08
2  8.71   10.71
3  8.43   11.59
4  8.73   12.11

In [17]:
pd_prices.iloc[:-1]

   BLUE  ORANGE
0  8.70   10.66
1  8.91   11.08
2  8.71   10.71
3  8.43   11.59

##same rows are aligned and divided

In [18]:
pd_prices.iloc[1:]/pd_prices.iloc[:-1]

   BLUE  ORANGE
0   NaN     NaN
1   1.0     1.0
2   1.0     1.0
3   1.0     1.0
4   NaN     NaN